{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Доп.задание по Python.ipynb",
      "provenance": [],
      "collapsed_sections": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "R-6q-_UuHNqR",
        "outputId": "bd0d42fc-94e9-4b0a-d1be-26b7e1a60fa1"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "['2002', '2009', '2016', '2023', '2037', '2044', '2051', '2058', '2072', '2079', '2086', '2093', '2107', '2114', '2121', '2128', '2142', '2149', '2156', '2163', '2177', '2184', '2191', '2198', '2212', '2219', '2226', '2233', '2247', '2254', '2261', '2268', '2282', '2289', '2296', '2303', '2317', '2324', '2331', '2338', '2352', '2359', '2366', '2373', '2387', '2394', '2401', '2408', '2422', '2429', '2436', '2443', '2457', '2464', '2471', '2478', '2492', '2499', '2506', '2513', '2527', '2534', '2541', '2548', '2562', '2569', '2576', '2583', '2597', '2604', '2611', '2618', '2632', '2639', '2646', '2653', '2667', '2674', '2681', '2688', '2702', '2709', '2716', '2723', '2737', '2744', '2751', '2758', '2772', '2779', '2786', '2793', '2807', '2814', '2821', '2828', '2842', '2849', '2856', '2863', '2877', '2884', '2891', '2898', '2912', '2919', '2926', '2933', '2947', '2954', '2961', '2968', '2982', '2989', '2996', '3003', '3017', '3024', '3031', '3038', '3052', '3059', '3066', '3073', '3087', '3094', '3101', '3108', '3122', '3129', '3136', '3143', '3157', '3164', '3171', '3178', '3192', '3199']\n"
          ]
        }
      ],
      "source": [
        "# Задание 1: Напишите программу, которая найдет все такие числа, которые делятся на 7, но не делятся на 5, от 2000 до 3200 (включая оба).\n",
        "# Полученные числа должны быть напечатаны в последовательности, разделенной запятыми, в одной строке.\n",
        "l=[]\n",
        "for k in range(2000, 3201):\n",
        "   if k%7==0 and k%5!=0:\n",
        "       l.append(str(k))\n",
        "print(l)"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Задание 2: Напишите программу, которая может вычислить факториалы заданных чисел. Результаты должны быть напечатаны в последовательности, разделенной запятыми, в одной строке.\n",
        "#Факториалом числа называют произведение всех натуральных чисел до него включительно. Например, факториал числа 5 равен произведению 1 * 2 * 3 * 4 * 5 = 120.\n",
        "\n",
        "# Формула нахождения факториала:\n",
        "\n",
        "# n! = 1 * 2 * … * n,\n",
        "\n",
        "# где n – это число, а n! – факториал этого числа.\n",
        "\n",
        "# Формулу можно представить в таком виде:\n",
        "\n",
        "# n! = 1 * … * (n-2) * (n-1) * n,\n",
        "\n",
        "# т.е. каждый предыдущий множитель меньше на единицу, чем последующий.\n",
        "\n",
        "\n",
        "from math import factorial\n",
        "l = [9, 15, 3, 1, 20]\n",
        "for k in range(len(l)):\n",
        "  if l[k] >= 0:\n",
        "    print(\"\\nДля числа \", l[k], \"факториал равен\",factorial(l[k]))\n",
        "  else:\n",
        "    print(l[k], \"не натуральное число\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "dmXGbRiNKIMz",
        "outputId": "1928b051-31dc-4808-c2d2-17df37d4e4e8"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "\n",
            "Для числа  9 факториал равен 362880\n",
            "\n",
            "Для числа  15 факториал равен 1307674368000\n",
            "\n",
            "Для числа  3 факториал равен 6\n",
            "\n",
            "Для числа  1 факториал равен 1\n",
            "\n",
            "Для числа  20 факториал равен 2432902008176640000\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Задание 3: Напишите программу, которая принимает 2 числа X, Y в качестве входных данных с клавиатуры и генерирует двумерный массив. Значение элемента в i-й строке и j-м столбце массива должно быть i*j. (нумерация с нуля)\n",
        "\n",
        "# Допустим для: i=3, j=5. Результат будет [ [0, 0, 0, 0, 0], [0, 1, 2, 3, 4], [0, 2, 4, 6, 8] ]\n",
        "\n",
        "\n",
        "def matrix_k (x, y):\n",
        "    matrix = [[0 for j in range(y)] for i in range(x)]\n",
        "    for i in range(x):\n",
        "        for j in range(y):\n",
        "            matrix[i][j] = j * i\n",
        "    print(\"матрица\", *matrix, sep='\\n') #print после окончания работы цикла\n",
        "\n",
        "x = int(input())\n",
        "y = int(input())\n",
        "matrix_k (x, y)\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "6PkGW3-Xh61U",
        "outputId": "5861d3a9-f543-4f61-9b90-771c4c0359a3"
      },
      "execution_count": 2,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "3\n",
            "5\n",
            "матрица\n",
            "[0, 0, 0, 0, 0]\n",
            "[0, 1, 2, 3, 4]\n",
            "[0, 2, 4, 6, 8]\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Задание 4: Веб-сайт требует, чтобы пользователи вводили имя пользователя и пароль для регистрации. Напишите программу для проверки правильности ввода пароля пользователями.\n",
        "# Ниже приведены критерии проверки пароля:\n",
        "\n",
        "# Как минимум 1 буква между [a-z] По крайней мере, 1 число между [0–9] По крайней мере, 1 буква между [A–Z] По крайней мере, 1 символ из [$#@] Минимальная длина пароля транзакции: 6 Максимальная длина пароля транзакции: 12\n",
        "\n",
        "\n",
        "import re\n",
        "def parol():\n",
        "  print('Введите пароль.')\n",
        "  password = input()\n",
        "  if len(password)<6:\n",
        "    print('Пароль должен быть более 6 символов')\n",
        "  elif len(password)>12:\n",
        "    print('Пароль должен быть менее 12 символов')\n",
        "  elif not re.search(\"[$#@]\", password):\n",
        "    print('Пароль должен содержать один из знаков $#@')\n",
        "  elif not re.search(\"[A–Z]\", password):\n",
        "    print('Пароль должен содержать одину букву из A–Z')\n",
        "  elif not re.search(\"[0-9]\", password):\n",
        "    print('Пароль должен содержать одино число из 0-9')\n",
        "  elif not re.search(\"[a-z]\", password):\n",
        "    print('Пароль должен содержать одину букву из a-z')\n",
        "  else:\n",
        "    print('Пароль корректный')\n",
        "\n",
        "parol()\n",
        "\n"
      ],
      "metadata": {
        "id": "kyZbukGHliCa",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "26e89c85-5858-4221-d564-21855e0ae121"
      },
      "execution_count": 12,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Введите пароль.\n",
            "LeraA2@\n",
            "Пароль корректный\n"
          ]
        }
      ]
    }
  ]
}